airpocket-soundman/FRDM-MCXN947_demo/14_led_rgb_button_my/frdmmcxn947_cm33_core0/led_blinky/pin_mux.c
/*
 * Copyright 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MCXN947
package_id: MCXN947VDF
mcu_data: ksdk2_0
processor_version: 0.14.14
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B16, peripheral: SWD, signal: SWO, pin_signal: PIO0_2/TDO/SWO/FC1_P2/CT0_MAT0/UTICK_CAP0/I3C0_PUR, slew_rate: fast, open_drain: disable, drive_strength: high,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B12, peripheral: GPIO0, signal: 'GPIO, 10', pin_signal: PIO0_10/FC0_P6/CT0_MAT0/FLEXIO0_D2/ADC0_B10, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);

    const port_pin_config_t port0_10_pinB12_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Pin is configured as PIO0_10 */
                                                      kPORT_MuxAlt0,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT0_10 (pin B12) is configured as PIO0_10 */
    PORT_SetPinConfig(PORT0, 10U, &port0_10_pinB12_config);

    const port_pin_config_t port0_2_pinB16_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* High drive strength is configured */
                                                     kPORT_HighDriveStrength,
                                                     /* Pin is configured as SWO */
                                                     kPORT_MuxAlt1,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT0_2 (pin B16) is configured as SWO */
    PORT_SetPinConfig(PORT0, 2U, &port0_2_pinB16_config);

    /* Enable PORT1 clock (BLUE LED is on PORT1) */
    CLOCK_EnableClock(kCLOCK_Port1);

    /* GREEN (PORT0_27) / BLUE (PORT1_2) : GPIO output, no pull. */
    const port_pin_config_t led_gpio_out_config = {.pullSelect          = kPORT_PullDisable,
                                                    .pullValueSelect     = kPORT_LowPullResistor,
                                                    .slewRate            = kPORT_FastSlewRate,
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    .openDrainEnable     = kPORT_OpenDrainDisable,
                                                    .driveStrength       = kPORT_LowDriveStrength,
                                                    .mux                 = kPORT_MuxAlt0,
                                                    .inputBuffer         = kPORT_InputBufferEnable,
                                                    .invertInput         = kPORT_InputNormal,
                                                    .lockRegister        = kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT0, 27U, &led_gpio_out_config); /* GREEN */
    PORT_SetPinConfig(PORT1, 2U, &led_gpio_out_config);  /* BLUE  */

    /* SW2 (PORT0_23) / SW3 (PORT0_6) : GPIO input, internal pull-up (active LOW). */
    const port_pin_config_t sw_input_config = {.pullSelect          = kPORT_PullUp,
                                               .pullValueSelect     = kPORT_LowPullResistor,
                                               .slewRate            = kPORT_FastSlewRate,
                                               .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                               .openDrainEnable     = kPORT_OpenDrainDisable,
                                               .driveStrength       = kPORT_LowDriveStrength,
                                               .mux                 = kPORT_MuxAlt0,
                                               .inputBuffer         = kPORT_InputBufferEnable,
                                               .invertInput         = kPORT_InputNormal,
                                               .lockRegister        = kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT0, 23U, &sw_input_config); /* SW2 */
    PORT_SetPinConfig(PORT0, 6U, &sw_input_config);  /* SW3 */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
